---
kind: enumMember
id: F:Autodesk.Revit.DB.IFC.IFCExtrusionBasis.InvalidBasis
enum: Autodesk.Revit.DB.IFC.IFCExtrusionBasis
source: html/19e272ae-693c-a2aa-31f1-0c5e442b8ba0.htm
---
# Autodesk.Revit.DB.IFC.IFCExtrusionBasis.InvalidBasis

An invalid basis (typically indicating that the extrusion extraction was unsuccessful).